dsc/funciones.tex
% Created 2019-02-22 Fri 00:33
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Jonathan Ahumada}
\date{\today}
\title{funciones}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.3.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{Funciones}
\label{sec-1}
Caso particular de una relacion donde cada elemento en el conjunto de imagen le corresponde máximo (0 se puede) un elemento del dominio.
\subsection{Inyectiva}
\label{sec-1-1}
funciones uno a uno. Tiene la condicion que \(f(x_{1})=f(x_{2}) \ entonces\ x_{1}=x_{2}\).
Esto es, si dos elementos tienen la misma imagen, deben ser el mismo.

Determine si la funcion \(f(x) = x + 2\) es inyectiva.

\begin{equation}
\begin{split}
$x_{1} + 2 & = $x_{2} + 2 \\
$x_{1} & = $x_{2} +2 - 2 \\
$x_{1} & = $x_{2}
\end{split}

\end{equation}

Esto es una forma de mostrar que es inyectiva.


Determine si la funcion \(f(x) = x^2 + 1\) es inyectiva.

\begin{equation}
\begin{split}
{x_{1}}^2 + 1 & = {x_{2}}^{2} + 1 \\
{x_{1}}^2 - {x_{2}}^2 & = 1 - 1 \\
{x_{1}}^2 - {x_{2}}^2 & = 0 \\
(x_{1} -x_{2})(x_{1} +x_{2}) & = 0
\end{split}

\end{equation}
Esta ecuacio no es inyectiva.

Con esto aprecen dos respuestas. Hay una de esas respuestas que no satisface la condición.
\subsubsection{prueba de la linea horizontal}
\label{sec-1-1-1}
En la gráfica de una funcion f, una linea horizontal solo puede tocar máximo un solo punto.

\subsection{¿Y si no mme dan los conjuntos de partida y llegada?}
\label{sec-1-2}
Asumimos que son los reales. R x R.

\subsection{Sobreyectiva}
\label{sec-1-3}
rango no es lo mismo que codominio.
\begin{enumerate}
\item rango = conjunto de llegada
\item codominio = todas las posibles imágenes.
\end{enumerate}

Una función es sobreyectiva si el \textbf{rango es igual al codominio}.
\begin{verbatim}
   Dominio                        +------------------+
+------------+                    |  +------+        |   Codominio
|            |         /----------+--+> 4   | Rango  |
|    1 <-----+---------           |  |      |        |
|            |          /---------+--+->5   |        |
|     2 -----+----------          |  |      |        |
|            |                 /--+--+> 6   |        |
|            |  /--------------   |  |      |        |
|    3  -----+--                  |  +------+        |
+------------+                    |                  |
				  |          7       |
				  |                  |
				  +------------------+
\end{verbatim}


Aquí, \(rango = \{4,5,6\}\) y \(codominio = \{4,5,6,7\}\), luego \(rango \neq codominio\).


Determine si la funcion \(f(x) = x + 2\) es sobreyectiva.
\begin{equation}
\begin{split}
 y  & = x + 2 \\
 y - 2 & = x \\
 y & = x - 2 \\
\end{split}

\end{equation}

Hay alguna restricción para y?:
\begin{enumerate}
\item raiz
\item división
\end{enumerate}

Entences y puede tomar todos los reales. 
La función es sobreyectiva.

\subsection{Biyectiva}
\label{sec-1-4}
Debe ser :
\begin{enumerate}
\item Inyectiva
\item Sobreyectiva
\end{enumerate}

\section{Función inversa}
\label{sec-2}

Para hallar f$^{\text{-1}}$. La función f debe ser:
\begin{enumerate}
\item real (esto es, contenida en los reales)
\item biyectiva
\end{enumerate}

La funcion inversa de a invierte el dominio con el codominio:

\[f(x) = y \ luego\ f^{-1}(y)= x\]
% Emacs 25.3.1 (Org mode 8.2.10)
\end{document}